

const AzkarM = [
    {
      id: 1,
      text: 'الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده',
      count: null
    },
    {
      id: 2,
      text: 'أعوذ بالله من الشيطان الرجيم { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }',
      count: null
    },
    {
      id: 3,
      text: 'بسم الله الرحمن الرحيم{ قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بسم الله الرحمن الرحيم {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ *وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ } بسم الله الرحمن الرحيم{ قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }',
      count: 'ثلاث مرات'
    },
    {
      id: 4,
      text: ' أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر',
      count: null
    },
    {
      id: 5,
      text: 'اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور',
      count: null
    },
    {
      id: 6,
      text: 'اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت',
      count: null
    },
    {
      id: 7,
      text: 'اللهم إني أصبحت أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك',
      count: 'أربع مرات'
    },
    {
      id: 8,
      text: 'اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر ',
      count: null
    },
    {
      id: 9,
      text: 'اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت .اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت ',
      count: 'ثلاث مرات'
    },
    {
      id: 10,
      text: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم ',
      count: 'سبع مرات'
    },
    {
      id: 11,
      text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي',
      count: null
    },
    {
      id: 12,
      text: 'اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم',
      count: null
    },
    {
      id: 13,
      text: ' بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم',
      count: 'ثلاث مرات'
    },
    {
      id: 14,
      text: 'رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً',
      count: 'ثلاث مرات'
    },
    {
      id: 15,
      text: 'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين',
      count: null
    },
    {
      id: 16,
      text: 'أصبحنا وأصبح الملك لله رب العالمين ، اللهم إني أسألك خير هذا اليوم : فتحه، ونصره ،ونوره ،وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده',
      count: null
    },
    {
      id: 17,
      text: 'أصبحنا على فطرة الإسلاموعلى كلمة الإخلاص، وعلى دين نبيَّنا محمد صلى الله عليه وسلم وعلى ملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين',
      count: null
    },
    {
      id: 18,
      text: 'سبحان الله وبحمده',
      count: 'مائة مرة'
    },
    {
      id: 19,
      text: 'لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير',
      count: 'مائة مرة أو عشر مرات أو مرة واحدة عند الكسل'
    },
    {
      id: 21,
      text: 'سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته',
      count: 'ثلاث مرات'
    },
    {
      id: 22,
      text: ' اللهم إني أسألك علماً نافعاً ، ورزقاً طيباً ، وعملاً متقبلاً ',
      count: null
    },
    {
      id: 23,
      text: 'أستغفر الله وأتوب إليه ',
      count: 'مائة مرة في اليوم'
    },
    {
      id: 25,
      text: ' اللهم صل وسلم على نبينا محمد ',
      count: 'عشر مرات'
    }
];

const AzkarE = [
  {
    id: 1,
    text: 'الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده',
    count: null
  },
  {
    id: 2,
    text: 'أعوذ بالله من الشيطان الرجيم { اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ }',
      count: null
  },
  {
    id: 3,
    text: 'بسم الله الرحمن الرحيم{ قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بسم الله الرحمن الرحيم {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ } بسم الله الرحمن الرحيم{ قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ *مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ }',
      count: 'ثلاث مرات'
  },
  {
    id: 4,
    text: 'أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر',
      count: null
  },
  {
    id: 5,
    text: 'اللهم بك أمسينا، وبك أصبحنا، وبك نحيا وبك نموت، وإليك المصير',
      count: null
  },
  {
    id: 6,
    text: 'اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت',
      count: null
  },
  {
    id: 7,
    text: 'اللهم إني أمسيت أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك',
      count: 'أربع مرات'
  },
  {
    id: 8,
    text: 'اللهم ما أمسى بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر ',
      count: null
  },
  {
    id: 9,
    text: 'اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت .اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت ',
      count: 'ثلاث مرات'
  },
  {
    id: 10,
    text: 'حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم ',
      count: 'سبع مرات'
  },
  {
    id: 11,
    text: 'اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي',
      count: null
  },
  {
    id: 12,
    text: 'اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم',
      count: null
  },
  {
    id: 13,
    text: ' بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم',
      count: 'ثلاث مرات'
  },
  {
    id: 14,
    text: 'رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً',
      count: 'ثلاث مرات'
  },
  {
    id: 15,
    text: 'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين',
      count: null
  },
  {
    id: 16,
    text: 'أمسينا وأمسى الملك لله رب العالمين ، اللهم إني أسألك خير هذه الليلة: فتحها ونصرها ونورها وبركتها وهداها وأعوذ بك من شر ما فيها وشر ما بعدها',
      count: null
  },
  {
    id: 17,
    text: 'أمسينا على فطرة الإسلام وعلى كلمة الإخلاص، وعلى دين نبيَّنا محمد صلى الله عليه وسلم وعلى ملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين',
      count: null
  },
  {
    id: 18,
    text: 'سبحان الله وبحمده',
      count: 'مائة مرة'
  },
  {
    id: 19,
    text: 'لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير',
      count: 'عشر مرات أو مرة واحدة عند الكسل'
  },
  {
    id: 23,
    text: 'أستغفر الله وأتوب إليه ',
      count: 'مائة مرة'
  },
  {
    id: 24,
    text: 'أعوذ بكلمات الله التامات من شر ما خلق',
      count: 'ثلاث مرات'
  },
  {
    id: 25,
    text: ' اللهم صل وسلم على نبينا محمد ',
      count: 'عشر مرات'
  }
];

function Azkar(props) {

  const zikrs = props.time === 'm' ? AzkarM : AzkarE;
  const daytime = props.time === 'm' ? 'الصباح' : 'المساء';

    return (
        <div className="azkarContainer">
            <h1>أذكار {daytime}</h1>
            <div className="zikrContainer">
                {zikrs.map((zikr) => (
                  <>
                    <div key={zikr.id} className="zikr">
                        <p>{zikr.text}</p>
                        {zikr.count && (
                        <div className="extra">
                            <p className="extraCount">{zikr.count}</p>
                        </div>
                        )}
                    </div>
                  </>
                ))}
            </div>
        </div>
    );
}

export default Azkar;